{
    "url": "https://www.reddit.com/r/pokemon/comments/2fugiw/oras_playthrough_teams/",
    "selftext": "Do any of you have a team set for when ORAS comes out? I'd like to see the different teams everyone uses. I'm having trouble picking a starter, I love all three. Definitely using Flygon, with or without a mega.",
    "comments": [
        "Sceptile, Camerupt, Azumarill, Sableye, Swellow, Medicham. I might change things around a bit to accommodate Flygon, yeah,",
        "Nope. Just gonna roll with it. I'll get a Skarmory and a Sealeo or something when I get the chance. Starter's gonna be Mudkip, 'cause Mudkip.",
        "I'm using Torchic, shroomish, Sharpedo, and Chansey. \n\nTorchic and Sharpedo are IV trained and ready to go. Still working on the other two. ",
        "Sceptile\n\nManectric\n\n(Torkoal)\n\nArmaldo\n\nFlygon \n\nMilotic\n\n(Metagross)\n\nI'm still deciding between Torkoal and Metagross. I really love the way Torkoal.looks, but Metagross adds more to my team.\n\nI use my Hoenn team competitively and I have to say that Shell Smash Torkoal is not as good as I hoped.\n\nSo many fast special attackers and priority moves xD",
        "I'm picking treeko, my gf will have mudkip, I'll probs take all HOENN pokemon, as that's what I try to do for my first play. I'm considering, sceptile, camerupt, aggron, wailord, glalie and banette. \n\nThis team changes on a daily basis",
        "Probably Swampert, Flygon, Tropius, Mightyena, Aggron and Manectric ",
        "Sceptile, Delcatty, Sableye, Manectric, Golduck, Flygon",
        "I'm thinking I'm going to be transferring over a Protean Kecleon and a Perfect IV Treeko. Beyond that I'm probably gonna pick up Cosplay Pikachu and then just roll with the punches.",
        "I might use the offspring of my team from pokemon emerald which would be vigoroth,swampert,pelipper,poochyena,dustox,azumarill.  for vigoroth and poochyena i don't allow them to evolve because slakings ability sucks and i just like keeping poochyena as a poochyena. or i might just pick random pokemon all together or do a mystery egg run all depends what i feel like",
        "I've had mine set for a while:\n\nLudicolo - Medicham - Altaria - Banette - Walrein\n\nOld Hoenn favorites that I just never got around to using. Also going to enforce a few self-imposed rules (only one evolution/capture between major bosses, no EXPShare, set battle, no items in battle).",
        "* Sceptile\n* Blaziken\n* Empoleon\n* Swellow\n* Aggron\n* Altaria/Metagross\n* **well that's my team. in;b4 \"why no Swampert\" replies. Gonna say it now, I fucking hate the mudkip line**",
        "Sceptile, Camerupt, Sharpedo, Manectric, Gallade, Salamence/Flygon"
    ]
}