{
    "url": "https://www.reddit.com/r/pokemon/comments/2n71kc/whats_currently_your_oras_team/",
    "selftext": "Since I don't have the game yet (I'm european) I'd like to know what team are you using to beat the game! Or if you already did, what team you used!\n\nI'm planning on using Sceptile, Ninjask or Shedinja, Mawile, Sableye, Sharpedo and probably a Swellow or a Pidgeot :P ",
    "comments": [
        "Machoke\n\nSwellow\n\nSwampert\n\nManectric \n\nNinetales \n\nGardevoir \n\nI'm hoping to find a bacon soon",
        "salamence, swampert, swellow, gardevoir, eelektross and sableye. only reason for the sableye was because i found a shiny one in victory road so i kept it on the team!",
        "I currently have Gardevoir, Shiny Metang, Combusken, Swellow, Tentacruel, and soon shiny Latios after it finally decides to sparkle for me",
        "I'm breeding a blaze kick chimchar , a carvanha with waterfall,  a gible with iron head and I'm gonna add the treecko, a mawile, and an electrike with probably mega sharpedo",
        "I haven't had much time to play. I just got past the first gym. Currently I have:\n\nLvl 18 Combusken\n\nLvl 18 Mightyena \n\nLvl 14 Beldum\n\nLvl 7 Ralts (Just picked one up)\n\nI'll probably replace Mightyena later down the road and possibly Ralts as well. ",
        "Swampert\nGardevoir\nMawile\nNinetales ",
        "Swampert lv 45\n\nCamerupt lv 45\n\nVileplume lv 45\n\nLatias lv 45\n\nSwellow lv 45\n\nShiny metagross lv 45\n\n",
        "Treecko\n\nBeldum (shiny)\n\nPoochyena (ice fang)\n\nTailow (roost + adamant)\n\nSkitty (sucker punch + adamant + unfortunately normalise)\n\nI'm 14 hours in at Dewford and let's just say I got carried away with the whole DexNav feature early on haha!\n\nEdit: My 6th will most likely be another pokemon that is pretty basic like these just so they match. probably an electric type from near Mauville.",
        "Currently\nSwablu; Level 29 (training him now to catch up with my team)\nMetang; Level 43\nCamerupt; Level 41\nSwampert; Level 42\nBreloom; Level 41\nPelliper; Level 41\n\nPelliper is on the chopping block once I find a spheal though. ",
        "M. Sceptile, Wailord, Shiny M. Altaria, Slaking, S. Mega Sableye, Camerupt. ",
        "Planning to use\n1. Swampert\n2. Luxray\n3. Talonflame\n4. Roserade\n5. Gallade (+Mega)\n6. Absol (+Mega)\n\nI don't really like Swampert's mega all that much",
        "Shiny Metang, Shiny Zorua, Shiny Ralts, Honedge, Sylveon, and I can;t recall what the last is, maybe the shiny Gengar event without a gengarite. Do I have any type weakness problems?",
        "Swampert, Pidgeot, Machamp and Jolteon. Mega Pidgeot is a monster that wrecks anything that stands in its way. ",
        "The lack of flygon is uncomfortable.",
        "European so haven't got the game yet :(\nPlan on using\nSceptile\nCamerupt\nFlygon\nGallade\nWalrein\nSwellow"
    ]
}