{
    "comment_ids": [
        "cy5u240",
        "cy5w1e2",
        "cy5w5wl",
        "cy5xa1q",
        "cy5yftr",
        "cy5zfhw",
        "cy5zhe2",
        "cy606l4",
        "cy60nyj",
        "cy6139z",
        "cy614rq",
        "cy63p4k",
        "cy64ub7",
        "cy658jg",
        "cy65dx5",
        "cy65s0w",
        "cy66rif",
        "cy66wuw",
        "cy6891b",
        "cy68h1q",
        "cy697ls",
        "cy69gxz",
        "cy69uau",
        "cy6a3sn",
        "cy6ahea",
        "cy6aiio",
        "cy5ultr",
        "cy5vyfi",
        "cy6behd",
        "cy6bift",
        "cy6c75u",
        "cy6d8ri",
        "cy6dsiu",
        "cy6g39t",
        "cy6gg7i",
        "cy6jqfh",
        "cy6ljla",
        "cy6zxmj",
        "cy721k9",
        "cy72n7m",
        "cy78fof",
        "cy7iuxv",
        "cy7nnqj",
        "cy7wuf0",
        "cy81sqy",
        "cy8f71w",
        "cy9kbav",
        "cy9v3zk",
        "cy6102y",
        "cy5wam9",
        "cy65497"
    ],
    "comments": [
        "Swampert, Blaziken, Drapion, Garchomp, Gardevoir, Dusclops.",
        "Sceptile, Metagross, Walrien, Camerupt, Linoone, Altaria. ",
        "Honchkrow, Skarmory, Gliscor, Noivern, Altaria, and Pidgeot. I wanted to do a mono-flying run with Pokemon I hatched.",
        "I always modify my team after every gym to use supereffective pokemon so i used more than 6 pokemon, but the team i used against the E4 was:\n\nSceptile\n\nSharpedo\n\nMedicham\n\nMetagross\n\nArmaldo\n\nZangoose",
        "Sceptile, Manectric, Milotic, Delcatty, Gardevoir, and Skarmory. ",
        "sceptile,metagross,swellow,bidoof, charizard and sylveon",
        "Omega Ruby: Swampert, Shiftry, Mightyena (the first one you find with the DexNav), Metagross (the shiny event one), and Altaria (I didn't really plan anything for my team so my sixth team member was between the Cosplay Pikachu and Latios)  \n\nAlpha Sapphire: Sceptile, Crobat, Azumarill, Gallade, Flygon, and Sableye (towards the end of the game I had to switch around Sableye with a Tentacruel I used for HMs)",
        "Zangoose, Mightyena, Swellow, Sceptile, and Banette. \nI just used what I liked and the 6th slot changed alot",
        "Masquerain, Grumpig, Sandslash and Wigglytuff <- MAIN TEAM\n\nGolduck, Skarmory <- HM SLAVES",
        "Sceptie, Shedinja, Altaria, Sharpedo, Camerupt, Aggron",
        "Swampert, Breloom, Skarmory, Pikacu Rock Star, and Kyogre. (Only time when I had 5 pokemon it seems)",
        "Swampert, Mawile, Tyranitar, Lucario, Latias and Pikachu.\n\nSome temporary members include Skarmory, Absol, Metang, Kirlia and Tropius.\n",
        "Swampert, Gardevoir, Yanmega, Breloom, Exploud, Aggron\n\nHadn't used any of them except Swampert before",
        "Sceptile, Mightyena, Gardevoir, Swellow, Torkoal, Milotic. ",
        "Sceptile, Salamence, Wigglytuff, Clawitzer, Heracross, Gothitelle",
        "Swampert, Milotic, Gallade, Froslass, Camerupt, Cacturne",
        "Swampert, flygon, swellow, manetric, camerupt, glalie ",
        "Swampert, Gardevoir, Breloom, Crobat, Manectric, and Latios.",
        "I used to REALLY love grass types.\n\nSceptile\nBreloom\nLudicolo\nNinjask\nGardevoir\nAggron",
        "Swampert, Dragalge, Camerupt, Latios, Metagross, Banette\n",
        "Blaziken, Gardevoir, Breloom, Gyarados, Latias, Absol.",
        "Swampert / Shiftry / Electrode / Noivern / Medicham / Infernape\n\nHonorable mentions that didn't quite make it through to the end:\nMagcargo / Latios / Skarmory / Linoone ([*] HM Slave)",
        "Sceptile, Exploud, Electrode, Swalot, Grumpig, and Milotic.\n\nI was trying to go for all Hoenn but a certain reverse Poke Ball wormed his way onto my team.",
        "Final E4 team: Ninetails, Gardevoir, Flygon, Lapras, Absol, Breloom",
        "Blaziken, Shiftry, Salamence, Walrein, Gardevoir, Aggron! ",
        "Swampert\n\nManectric\n\nSwellow\n\nGardevoire\n\nCacturne\n\nCan't remember the last one",
        "Sceptile, Gallade, Latios, Absol, Milotic,Arcanine",
        "Sceptile\nCamerupt\nMightyena\nPika uh\nSamurott\nLatias",
        "Sceptile (Mega)\nLinoone (Shiny)\nCamerupt\nMilotic\nMagnezone\nSableye",
        "Lucario, Lucario, Lucario, Sceptile, Skarmory, Steelix. Got a Riolu from Wonder Trade and made a few eggs.",
        "Swampert, Gardevoir, Roserade(Shiny = Had to use it, so pretty!), Crobat, Froslass, Armaldo",
        "Swampert, Swellow, Ninetales, Latios, Roserade, Glalie\n\nI didn't really know who else to put on the team once I got Latios and Glalie, so I used them. Thing is the amount of times I have played Gen 3 I wanted something different, then I left it too late. Oh well. ",
        "Sceptile\nBreloom\nLudicolo\nTropius \nCacturne \nVileplume",
        "Team: Gengar, Tyranitar and Metagross \n\nSlaves: Smeargle, Tropius and Sharpedo \n\n\nI'm currently at the entrance of the victory road. ",
        "Shiny Metagross, shiny Camerupt, Altaria, Masquerain, Lanturn, Breloom",
        "Macargo and 5 eggs @_@",
        "Sceptile\nMilotic\nCamerupt\nManectric\nLatios\nForgot #6. May have been Absol.",
        "Swampert, Blaziken, Mightyena, Luxray, Wailord, Makuhita ",
        "Water monotype:\nGastrodon\nLudicolo\nSharpedo\nTentacruel\nWalrein\nPelipper",
        "Sceptile, Breloom, Ludicolo, Mightyena, Shedinja, Swellow. Love my grass types but this game made me learn to give pokemon later in the game a chance for once hah",
        "Sceptile \nPelipper\nAlakazam\nMagnezone\nFlygon\nArmaldo",
        "I used a lot of different Pokemon in Omega Ruby from many different games, but the ones I caught in Omega Ruby itself were\n\nSceptile (LeafErikson)\n\nShiftry (Gridon, no one will get this lol)\n\nGallade (SetoKaiba)\n\nMightyena (Poochy)\n\nSwellow (Shadow)\n\nLatios (Sapphire)",
        "I usually just use two Pokemon's for a storyline. for ORAS it was Flygon and Rotom-heat.",
        "Alpha Sapphire\nSceptile\nSteven's Metagross\nDusknoir\nWash Rotom\nLatias\nDemo Glalie",
        "Swampert, Luxray, Leafeon, Metagross, Talonflame, and Linoone",
        "Here is what I beat the elite four with:\n\n(M) Blaziken 60\n\nMilotic 55\n\n(Libre) Pikachu 49\n\n(Mega) Metagross 53 / Glaceon 52\n\n(Mega) Gardevoir 52\n\nAltaria 52",
        "ASapphire (since it's my only stable game - ORuby has been reset way too many times already)\n\nSceptile, Breloom, Plusle, Flygon, Walrein, and then it interchanges between Gardevoir or Metagross (I used the Mystery Gift Beldum throughout the game, but I've swapped in Gardevoir since I got a megastone for her)",
        "Slaking, Magmortar, Meowstick, Baynett, Haxerous, and Delcatty",
        "Magikarp, Wurmple, Silicoon, Sunskirt, Shroomish, and a Treecko.\nAll are staying unevolved as they are cooler that way... :)\n\n(Actually Blaziken, Lombre, Mightyena, Linoone Swellow/Beautifly and empty for testing/evolving newer stuff. )",
        "Sceptile / Azumarill / Breloom / Gardevoir / Camerupt / Altaria\n\nProbably the best in-game team I've ever had.",
        "I have two teams in AS:\nA Team:\nTalonflame, Breloom,Manectric, Pelipper, Roserade, Golem, Espeon, Latias, Mightyena, Walrein, Swellow, Hariyama, Metagross, Camerupt, Kingler, Umbreon, Blaziken, Gardevior, Vileplume, Altaria, and Azumarill.\n\nB Team:\nAlakazam,Bellossom, Wailord, Kirlia, Luxray, Ninetales, Aranine, Lapras, Pidegot, Cosplay Pikachu, Glaceon, Sylveon, Doublade, Joltik, Zigzagoon, Linoone, and Eevee.\n\nA Team are Pokemon that are Elite Four material. Aka I used them in the main story. Expect for Talonflame. Due to breeding I use him a lot for hatching eggs and is on my team while training Pokemon to fill the dex. Thus bumping him up from Team B.\n\nB Team are Pokemon that I considered for the Elite Four, HM slaves, or have a special attachment toward them. Some of them I transfer from different games.\n\nI love training a lot of Pokemon hence why I love the new Exp. share. Why should I only use six Pokemon out of 721?"
    ],
    "id": "3xmb42",
    "selftext": "what was your team for the first time you played it\nmine was: \n\n\nsceptile\n\naltaria\n\naggron\n\n\ngyrados\n\n\n\ngallade\n\n\n\n\ncamerupt",
    "url": "https://www.reddit.com/r/pokemon/comments/3xmb42/your_oras_team/"
}