{
    "url": "https://www.reddit.com/r/pokemon/comments/5tjapu/pokemon_oras_what_was_your_team/",
    "selftext": "I'm currently running through ORAS and I'm only at Lavaridge Town and was wondering what everyone else's team was.\n\nMine so far: Combusken, Kirlia, Leafeon, Aron, Tentacool, HM slave",
    "comments": [
        "Blaziken, Aggron, Flygon, Milotic, Absol, Dusknoir.\n\nI wanted to focus on using Hoenn Mons only (Dusknoir was Dusclops for most of the game). Swampert is my favourite starter but Milotic is my favourite Pokemon so Milotic was locked in for my Water type, so I went with Blaziken.",
        "I'm replaying it now and I've decided to go with a variation on my classic Emerald team (Swampert, Breloom, Swellow, Torkoal, Grumpig, Glalie) and dropping Swellow and Grumpig for Aggron and Latias. I don't normally use legendaries but Latias is my favorite for some reason and has ingame utility. Super hyped about this group",
        "Sceptile, Manectric, Gyarados, Swellow, Metagross, Mawile and HM slave.",
        "Mine was Mega Swampert, Gardevoir, Camerupt, Breloom, Aggron and Latios. The team all pulled it's weight, and I managed to beat the Elite 4 with a level 54 Swampert and around level 47 with everything else.\n\nI'd recommend Latios/Latias as an HM slave. It learns Fly, Dive, Surf and Cut, so unless you're running a special attacker that uses Surf it's really effective. ",
        "I almost can't remember, oras seems so long ago now haha. But mine was Jolteon, Aggron, Sylveon, Porygon-Z,  Serperior, and Flygon.",
        "If I remember correctly, I had Sceptile,  Walrein, Banette, Camerupt, Swalot, and Manectric",
        "Doing my first playthrough with Alpha Sapphire and I just barely got my Shiny Treecko, so that's all I have lol.",
        "First team: Mega Swampert, Metagross(event shiny Beldum), Marill (HM Slave), Skarmory, Flygon, Primal Kyogre\n\nEvery run through since (no more event Beldum): Mega Swampert, Skarmory, Marill(HM Slave), Aggron, Flygon, Primal Kyogre\n\nPost game team: Swampert, Salamence, Metagross, Skarmory, Mega Rayquaza, Primal Kyogre",
        "My first team was: Swampert,  breloom, Aggron, Plusle, Altaria, and Keclion. \n\n\nI built the team with mega evolution and hidden abilities in mind, although I used every mega I had with me, I usually tended to use mega Aggron since it changes type to something more viable.\n\n\n\nPlusle and Keclion were added because of their new hidden abilities, although Plusle's lightning rod almost never came in handy, Keclion's protein was exceptional, although it could have used more Sp.Attack.\n\n\nultimately the whole team ended up carrying their weight, if you haven't I heavily suggest trying out some different teams with different abilities.",
        "Blaziken, Milotic, Gardevoir, Aggron, Flygon, Metagross",
        "Mega Blaziken, Ninjask, Ludicolo, Azumarill, Shiny Metagross and Latias",
        "Blaziken, Shiftry, Magnezone, Armaldo, Glalie, and Dusclops.",
        "Sceptile, Gallade, Manectric, Camerupt, Crawdaunt, Flygon",
        "Mightyeena, swampert, latias, kyogre, cosplay pika,and linoone (hm slave)",
        "sceptile, metagross, latias, sharpedo, gallade, glalie\n\nI was really excited about the new megas so I wanted a full mega potential team",
        "Final Team was:\nSwampert\nMetagross\nLatios\nGroudon\nShiftry\nSwellow(Not entirely sure on this last one. Can't really remember)",
        "I competitively bred and EV trained my team before my last playthough.\n\nMega Charizard X, Azumarill, Magnezone, Gallade, Latios (Literally only for fly), Linoone (Slave)",
        "My Omega Ruby team was Swampert, Linoone, Mightyena, Exploud, Breloom, and Swellow.\n\nI didn't use an HM Slave, I had my entire team share the load except for Dive, which I used my Wailord just for that area.",
        "Blaziken, Metagross, Plusle, Azumarill (WaterHM slave), Latias and Mightyena",
        "First: mega swampert, mega shiny metagross (event), swellow (later replaced by Rayquaza in the post game), mega Latios, Primal Groudon, mega manectric.\nThat's 6 mega/primal Pokémon by the post game. Never really noticed that.\n\nSecond playthrough: the same thing but instead of metagross I had a Breloom\n\nThird playthrough: mega blaziken, Samurott (traded in), torterra (traded in), magnezone, mega altaria, mega gardevoir",
        "Mine was Swampert, Venusaur, Gyarados, Latios Primal Groudon and Mega Mawile. \n\nMega Mawile was just ridiculously good IIRC, and between her and PGroudon essentially solo'd much of it  the E4. \n\nTbh, I got ORAS only in the run up to S/M from my nephew, so didn't have much investment in it. My Kalos Team brought more fun for myself and I had more investment emotionally in my Mega Char Y, Talonflame and Greninja. ",
        "Blaziken, Mightyena, Miltank, Chatot, Ludicolo, and a Sandslash named Sprinkles. ",
        "Blaziken, Mightyena, Swellow, Manectric, Latias, & Azumarill ",
        "Shedinja, Milotic, Tropius, Sharpedo, Torkoal, and (Shiny Event) Metagross. I remember I made the team before the game released, and was really hoping for a Water/Fairy Mega Milotic :(",
        "I had a bit of an evolving team. It actually took me awhile to beat the game--I kept getting distracted and putting it down for chunks of time--so when I'd pick it back up, inevitably I'd be bored with half my team, and switch them all out.\n\nI imported in a Munchlax as my \"starter\", since I'd recently used all three of the Hoenn starters, so that Snorlax was basically my only consistent member across all the teams.\n\nMy initial team involved Dustox, Breloom, Exploud, Cosplay Pikachu, and Lunatone. Then I ended up adding new members, with shiny Geodude (I much prefer the golden color to its evolutions colors, so it got an Eviolite), Crawdaunt, and Froslass. It seems I decided to beat the Elite Four with Snorlax/Breloom/Exploud/Crawdaunt/Froslass/Lunatone.\n\nNow that I've beaten the game, I've got a whole new team developing, involving Buneary, Bagon, and Totodile. I...I really didn't do much after I beat the game, I'm still in the middle of the Delta Episode.",
        "OR: Sceptile, Manectric, Camerupt, Milotic, Altaria, Froslass\n\nAS: Swampert, Breloom, Plusle, Swellow, Dusknoir, Flygom",
        "I beat Wallace recently, and so far, my team looks like:\n\nBlaziken, Gardevoir, Swellow, Sealeo (lvl. 43, so close to evolving!), Roserade, Vibrava.",
        "Sceptile, Latias, Swellow, Breloom, Gardevoir, Gallade.\n\nIn hindsight, I think my team was too reliant on Mega Evolution and Pyschic-types.",
        "It's funny how everyone casually has a Soave on their team (I get what an hm slave is). "
    ]
}