{
    "comment_ids": [
        "cmgcmt7",
        "cmgcdh0",
        "cmgcb2r",
        "cmgcdzs",
        "cmgcerh",
        "cmgctyv",
        "cmgcuiz",
        "cmgd0gg",
        "cmgdquv",
        "cmge0xo",
        "cmgefae",
        "cmgfhg2",
        "cmgij3v",
        "cmgn0dy",
        "cnblnha",
        "cn41j7g"
    ],
    "comments": [
        "Just starting elite 4 now. My team is:\n\n\n>•Sceptile (Rango) lvl. 46\n\n>•Pelipper (Peeko) lvl. 45\n\n>•Swallot (Kirby) lvl. 44\n\n>•Armaldo (Zoidberg) lvl. 45\n\n>•Camerupt (Azula) lvl. 43\n\n>•Dusclops (Koh) lvl. 46\n",
        "Sceptile, Ludicolo, Linoone, Latias, Kyorge and some pokemon i keep forgetting.",
        "Alakazam ralts and swampert. I'm not very far in the game.",
        "Shiny Gallade and Shiny Gardevoir ",
        "I'm in the middle of my playthrough. Right now I have:\n\nSwampert (Gumball)\n\nGardevoir\n\nBreloom (Banjo)\n\nMasquerian (Mochi)\n\nAltaria (Philly)\n\nSpinda (Boo)\n\nI really like everyone on my team, which is proving to be a bit of a problem. I just caught a Vulpix I want to use, and later on I'd like to use a Froslass. Taking a break from playing for now until I decide what to do.",
        "Mine currently is Sceptile, Gardevoir, Mightyena, Flygon,  Swellow, and (SP.Atk ) Sharkpedo\n",
        "Sceptile\n\nMilotic\n\nShelgon (traded over)\n\nCamerupt\n\nCastform\n\nManectric\n\nNever tried most of them and they seem great",
        "Hall of Fame team:\n\nSceptile\n\nLudicolo\n\nKyogre\n\nHawlucha (Wondetrade)\n\nMetagross \n\nCosplay Pikachu",
        "Sceptile, Metagross, Mightyena, Azumarill, Manectric, Altaria, and Absol.\n\nIf you really want to have fun, chain your future team members for cool and unusual moves, like I did in the cases of Aqua Jet on Azumarill, Megahorn on Absol, and Hyper Voice on Altaria.",
        "Blaziken, Gardevoir, Ludicolo, Zangoose, Froslass, Salamence. ",
        "gots me a crobat, sharpedo, zangoose, blaziken, and that shiny metagross and latios. Omega ruby\n\nhonestly this team already feels too overpowering so im thinking about starting the game over now that I got a good idea what to do",
        "I did my first play though with an all grass team. Septile, Ludicolo, Shiftry, Cradily, Breeloom, and Tropius it was pretty fun.\n\nNow I'm doing a more balanced team. So far I have Combusken, Aron, Electrike,  Swellow, and Mightyena. I'm thinking about Kindgra for my final slot but I may replace Swellow with something as I continue. \n",
        "Just got to the elite 4. My team as it stands now is:\nBlaziken (lvl 73)\nGardevoir (lvl 72)\nManectric (lvl 72)\nAbsol (lvl 70)\nMilotic (lvl 73)\nFlygon (lvl 70)\nI'm in the middle of raising them to 75 right now on victory road.",
        "I'm at Lilycove City right now. My team is\n> * Blaziken (Apollo) Lvl. 45\n* Breloom (Prince Mush) Lvl. 43\n* Crobat (Batman) lvl. 44\n* Metagross (Gohma) lvl. 43\n* Milotic (Thetis) lvl. 43\n* Flygon (Lanayru) lvl. 43",
        "Just beaten the 7th gym and my team is as follows:\n\nSwampert Lv. 55, Altaria Lv. 55, Aggron Lv. 52, Dustox Lv. 53, Infernape Lv. 54, Ludicolo Lv. 46",
        "I'm using my personal favourites, and since I like competitive play but nothing above UU really, I based my team around RU.\nSo I can't really win with any of the starters cause they all to OP so they will all be OU, so I just went all out with Mega Blaziken (I didn't use mine in X)\nThen I have a Cacturne, and a Wailord for the rest of my core (Grass, Fire, Water)\nThen I thought \"I need 1 more Mega\" and my favourite pokemon JUST SO HAPPENED to have a Mega! So I have a Mega Banette (I almost jizzed myself when u said u were considering using banette)\nThen I thought \"I need 2 walls. 1 Physical and 1 Special.\" so I went and picked up a Xatu and a Probopass! \nThat's my team :)"
    ],
    "id": "2ns5sg",
    "selftext": "I just got ORAS and am planning my in game team. I'm thinking Absol, Gardevoir or Gallade, Latias, Metagross, Froslass, and Flygon. I'm also considering Milotic, Banette, and Roserade. I'm just using pokemon I like, with no thought to any kind of competitive team building since I don't think it's necessary for playing the main story. What's your in game team?",
    "url": "https://www.reddit.com/r/pokemon/comments/2ns5sg/whats_your_in_game_oras_team/"
}